[
  {
    "slug": "epstein-transparency-act-signed-into-law",
    "title": "Epstein Transparency Act Signed Into Law",
    "summary": "President signs the Epstein Transparency Act into law, mandating the release of federal records related to Jeffrey Epstein's activities.",
    "topic": "Epstein Transparency Act signed into law mandating record release",
    "people": ["jeffrey-epstein"],
    "tags": ["transparency-act", "legislation"]
  },
  {
    "slug": "fbi-begins-epstein-records-review",
    "title": "FBI Begins Review of Epstein-Related Records Under New Law",
    "summary": "The FBI initiates its review process for Epstein-related records as mandated by the Epstein Transparency Act.",
    "topic": "FBI begins reviewing Epstein records under Transparency Act mandate",
    "people": ["jeffrey-epstein"],
    "tags": ["transparency-act", "fbi", "records-review"]
  },
  {
    "slug": "court-releases-new-batch-of-documents",
    "title": "Court Releases New Batch of Epstein-Related Documents",
    "summary": "A federal court releases hundreds of pages of previously sealed documents related to the Epstein case, including deposition transcripts.",
    "topic": "Federal court releases sealed Epstein deposition documents",
    "people": ["jeffrey-epstein", "ghislaine-maxwell"],
    "tags": ["court-documents", "document-release"]
  },
  {
    "slug": "2026-02-12-orioles-owner-david-rubenstein-named-in-epstein-files",
    "title": "Orioles Owner David Rubenstein Named in Epstein Files",
    "summary": "David Rubenstein, the billionaire co-founder of the Carlyle Group and owner of the Baltimore Orioles, met with Jeffrey Epstein in 2012, according to newly surfaced files.",
    "topic": "David Rubenstein Carlyle Group founder met Epstein post-conviction",
    "people": ["david-rubenstein", "jeffrey-epstein"],
    "tags": ["court-documents", "document-release", "associates"]
  },
  {
    "slug": "2026-02-12-trump-doj-accused-of-epstein-cover-up-over-file-redactions",
    "title": "Trump DOJ Accused of Epstein Cover-Up Over File Redactions",
    "summary": "A conservative television host is accusing the Trump administration of orchestrating a cover-up in the Epstein case, demanding criminal accountability for officials limiting document releases.",
    "topic": "Newsmax host accuses Trump DOJ of Epstein file cover-up",
    "people": ["donald-trump", "carl-higbie", "jeffrey-epstein", "leslie-wexner", "pam-bondi"],
    "tags": ["transparency-act", "document-release", "political"]
  },
  {
    "slug": "2026-02-13-goldman-sachs-top-lawyer-resigns-after-named-in-epstein-files",
    "title": "Goldman Sachs Top Lawyer Resigns After Named in Epstein Files",
    "summary": "Top Goldman Sachs Lawyer Kathryn Ruemmler Resigns After Epstein Files Release. Kathryn Ruemmler, Goldman Sachs' top lawyer and former White House counsel to President Obama, resigned after her name appeared in documents.",
    "topic": "Goldman Sachs lawyer Kathryn Ruemmler resigns over Epstein emails",
    "people": ["kathryn-ruemmler", "jeffrey-epstein", "barack-obama"],
    "tags": ["document-release", "associates", "breaking"]
  },
  {
    "slug": "2026-02-13-nyt-launches-major-investigation-into-millions-of-epstein-files",
    "title": "NYT Launches Major Investigation Into Millions of Epstein Files",
    "summary": "New York Times Deploys Two Dozen Journalists to Review Millions of Epstein Files.",
    "topic": "NYT assigns 24 journalists to investigate millions of Epstein documents",
    "people": ["jeffrey-epstein"],
    "tags": ["court-documents", "document-release", "investigation"]
  },
  {
    "slug": "2026-02-13-trump-calls-for-end-to-epstein-investigation",
    "title": "Trump Calls for End to Epstein Investigation",
    "summary": "Trump Says U.S. Should Move On From Epstein Investigation in CBS Interview.",
    "topic": "Trump tells CBS the country should move on from Epstein case",
    "people": ["donald-trump", "jeffrey-epstein"],
    "tags": ["political", "investigation"]
  },
  {
    "slug": "2026-02-13-court-allows-bofa-epstein-trafficking-lawsuit-to-proceed",
    "title": "Court Allows BofA Epstein Trafficking Lawsuit to Proceed",
    "summary": "Court Allows Epstein Victim's Trafficking Claims Against Bank of America to Proceed. A federal court in New York ruled that a victim can move forward with claims.",
    "topic": "Federal court allows Epstein victim trafficking lawsuit against Bank of America",
    "people": ["jeffrey-epstein"],
    "tags": ["court-documents", "victims", "investigation"]
  },
  {
    "slug": "2026-02-13-prince-andrew-s-bbc-claims-unravel-as-new-epstein-emails-surface",
    "title": "Prince Andrew's BBC Claims Unravel as New Epstein Emails Surface",
    "summary": "The disastrous 2019 BBC Newsnight interview where Prince Andrew denied sexual abuse allegations is now being measured against newly released Epstein files.",
    "topic": "New Epstein emails contradict Prince Andrew's BBC interview denials",
    "people": ["andrew-windsor", "jeffrey-epstein", "prince-andrew", "virginia-giuffre"],
    "tags": ["document-release", "testimony", "associates", "political"]
  },
  {
    "slug": "2026-02-13-dubai-ports-chief-resigns-after-hundreds-of-secret-epstein-emails-exposed",
    "title": "Dubai Ports Chief Resigns After Hundreds of Secret Epstein Emails Exposed",
    "summary": "The chairman of one of the world's largest port operators has stepped down after newly released documents revealed hundreds of email exchanges between him and convicted sex trafficker Jeffrey Epstein.",
    "topic": "Sultan bin Sulayem resigns from DP World over Epstein emails",
    "people": ["sultan-ahmed-bin-sulayem", "jeffrey-epstein", "leslie-wexner", "pam-bondi", "ro-khanna"],
    "tags": ["associates", "document-release", "breaking"]
  },
  {
    "slug": "2026-02-13-dp-world-chair-forced-out-as-epstein-documents-expose-global-ties",
    "title": "DP World Chair Forced Out as Epstein Documents Expose Global Ties",
    "summary": "A second senior executive at DP World has been forced out over connections to Jeffrey Epstein, marking an escalating crisis at the Dubai-based ports giant.",
    "topic": "Second DP World executive forced out over Epstein document connections",
    "people": ["jeffrey-epstein", "pam-bondi", "ro-khanna", "sultan-ahmed-bin-sulayem"],
    "tags": ["document-release", "associates", "breaking"]
  },
  {
    "slug": "2026-02-13-congress-subpoenas-wexner-billionaire-to-testify-on-epstein-ties",
    "title": "Congress to Depose Wexner in Ohio Over Epstein Ties",
    "summary": "Congressional investigators have backed down from their demand that Leslie Wexner testify in Washington, agreeing instead to depose the billionaire retail magnate in Ohio.",
    "topic": "Congress subpoenas Les Wexner for deposition on Epstein relationship",
    "people": ["leslie-wexner", "jeffrey-epstein"],
    "tags": ["testimony", "associates", "investigation", "breaking"]
  },
  {
    "slug": "2026-02-13-congress-subpoenas-mandelson-over-epstein-ties-in-major-probe",
    "title": "Congress Subpoenas Mandelson Over Epstein Ties in Major Probe",
    "summary": "Peter Mandelson, the UK's ambassador to the United States until last month, has been summoned to testify before Congress about his connections to Jeffrey Epstein.",
    "topic": "Congress summons former UK ambassador Mandelson over Epstein ties",
    "people": ["peter-mandelson", "jeffrey-epstein", "leslie-wexner", "pam-bondi", "ro-khanna"],
    "tags": ["investigation", "testimony", "associates", "political"]
  },
  {
    "slug": "2026-02-13-bondi-grilled-on-epstein-files-why-ag-resists-full-document-release",
    "title": "Bondi Grilled on Epstein Files: Why AG Resists Full Document Release",
    "summary": "The Attorney General came to defend the Justice Department's handling of the Epstein files. She left with a target on her back. Pam Bondi is now facing fierce criticism from within her own party.",
    "topic": "AG Bondi faces bipartisan backlash at House hearing on Epstein files",
    "people": ["pam-bondi", "jeffrey-epstein", "donald-trump"],
    "tags": ["transparency-act", "document-release", "testimony", "political", "breaking"]
  },
  {
    "slug": "2026-02-13-fbi-explains-why-epstein-files-remain-heavily-redacted",
    "title": "FBI Explains Why Epstein Files Remain Heavily Redacted",
    "summary": "The FBI has begun providing its justifications for the extensive redactions that have obscured key names and details in the Epstein files.",
    "topic": "FBI cites investigations and privacy to justify Epstein file redactions",
    "people": ["ghislaine-maxwell", "jeffrey-epstein", "leslie-wexner", "pam-bondi", "donald-trump", "thomas-massie"],
    "tags": ["fbi", "court-documents", "transparency-act", "document-release"]
  },
  {
    "slug": "2026-02-13-ag-bondi-caught-spying-on-democrats-epstein-files-searches",
    "title": "AG Bondi Caught Spying on Democrats' Epstein Files Searches",
    "summary": "The Justice Department's release of millions of Jeffrey Epstein files has triggered a constitutional crisis that goes beyond the identities of the disgraced financier's associates.",
    "topic": "DOJ caught tracking which lawmakers searched Epstein file names",
    "people": ["pam-bondi", "ghislaine-maxwell", "jeffrey-epstein", "ro-khanna", "sultan-ahmed-bin-sulayem", "donald-trump"],
    "tags": ["transparency-act", "investigation", "political", "breaking"]
  },
  {
    "slug": "2026-02-13-how-elite-immunity-protected-epstein-nyt-investigation-reveals",
    "title": "How Elite Immunity Protected Epstein: NYT Investigation Reveals",
    "summary": "The message from the newly released Epstein files isn't hidden in coded emails or encrypted hard drives. It's staring us in the face: a sexual predator operated with elite protection.",
    "topic": "NYT investigation reveals elite institutions protected Epstein systematically",
    "people": ["jeffrey-epstein", "leslie-wexner", "pam-bondi"],
    "tags": ["court-documents", "document-release", "investigation", "political"]
  },
  {
    "slug": "2026-02-13-piers-morgan-named-29-times-in-epstein-files-here-s-what-we-found",
    "title": "Piers Morgan Named 29 Times in Epstein Files—Here's What We Found",
    "summary": "British broadcaster Piers Morgan is pushing back against the revelation that his name appears in newly released Epstein files.",
    "topic": "Piers Morgan appears 29 times in Epstein files and denies connections",
    "people": ["piers-morgan", "jeffrey-epstein"],
    "tags": ["document-release", "associates", "transparency-act"]
  },
  {
    "slug": "2026-02-13-joe-rogan-epstein-files-scare-the-hell-out-of-me",
    "title": "Joe Rogan: Epstein Files 'Scare the Hell Out of Me'",
    "summary": "Joe Rogan said the Epstein files \"scare the s--- out of me\" and are \"definitely not a hoax\" during a recent podcast episode.",
    "topic": "Joe Rogan reacts to Epstein files on podcast calling them terrifying",
    "people": ["joe-rogan", "evan-hafer", "jeffrey-epstein", "leslie-wexner", "pam-bondi"],
    "tags": ["political"]
  },
  {
    "slug": "2026-02-13-senator-blocked-epstein-files-after-receiving-mysterious-donation",
    "title": "Senator blocked Epstein files after receiving mysterious donation",
    "summary": "A Republican senator who voted to block the release of unredacted Epstein files received a $50,000 donation from a dark money group with ties to wealthy individuals named in the documents.",
    "topic": "Senator voted against Epstein transparency after dark money donation",
    "people": ["jeffrey-epstein", "leslie-wexner", "donald-trump"],
    "tags": ["transparency-act", "political", "breaking"]
  },
  {
    "slug": "2026-02-13-khanna-demands-names-after-major-epstein-associate-steps-down",
    "title": "Khanna Demands Names After Major Epstein Associate Steps Down",
    "summary": "Representative Ro Khanna is publicly applauding the resignation of Sultan Ahmed Bin Sulayem and demanding full disclosure of names in the Epstein files.",
    "topic": "Rep Khanna demands name disclosure after DP World CEO resignation",
    "people": ["ro-khanna", "sultan-ahmed-bin-sulayem", "jeffrey-epstein", "leslie-wexner", "pam-bondi"],
    "tags": ["transparency-act", "breaking", "associates", "political"]
  },
  {
    "slug": "2026-02-13-newly-released-video-from-epstein-s-office-revealed-in-latest-files-dump",
    "title": "Newly Released Video from Epstein's Office Revealed in Latest Files Dump",
    "summary": "A camera hidden inside Jeffrey Epstein's Palm Beach office captured previously unseen video footage that has now emerged in the latest document release.",
    "topic": "Hidden camera video from Epstein Palm Beach office surfaces in files",
    "people": ["jeffrey-epstein", "leslie-wexner"],
    "tags": ["document-release", "court-documents", "investigation", "breaking"]
  },
  {
    "slug": "2026-02-13-nobel-chief-jagland-got-gifts-from-epstein-emails-reveal",
    "title": "Nobel Chief Jagland Got Gifts From Epstein, Emails Reveal",
    "summary": "The names kept coming. A former Norwegian prime minister who led the Nobel Committee. A Dubai port executive mentioned more than 4,700 times. A Commerce Secretary now riding Air Force One despite conflicting accounts of his island visits.",
    "topic": "Nobel Committee chair Jagland exchanged gifts and influence with Epstein",
    "people": ["jeffrey-epstein", "thorbjorn-jagland", "pam-bondi", "sultan-ahmed-bin-sulayem", "donald-trump"],
    "tags": ["document-release", "associates", "political", "breaking"]
  },
  {
    "slug": "2026-02-13-college-presidents-professors-named-in-epstein-files-fallout",
    "title": "College Presidents, Professors Named in Epstein Files Fallout",
    "summary": "At least three university presidents and multiple professors have been identified in recent Epstein document releases, forcing academic institutions from state schools to Ivy League to respond.",
    "topic": "University presidents and professors exposed in Epstein files",
    "people": ["jeffrey-epstein"],
    "tags": ["associates", "investigation", "document-release"]
  },
  {
    "slug": "2026-02-13-media-mogul-michael-ferro-canceled-last-minute-epstein-meeting-emails-reveal",
    "title": "Media Mogul Michael Ferro Canceled Last-Minute Epstein Meeting, Emails Reveal",
    "summary": "The names kept coming—splashed across congressional speeches, leaked in emails, surfacing in millions of newly released documents. But not all of them belonged.",
    "topic": "Media mogul Ferro's canceled Epstein meeting and misidentification risks in files",
    "people": ["michael-ferro", "jeffrey-epstein", "donald-trump", "leslie-wexner", "pam-bondi", "ro-khanna", "thomas-massie"],
    "tags": ["court-documents", "associates", "breaking"]
  },
  {
    "slug": "2026-02-14-lawmaker-names-6-men-hidden-in-epstein-files-despite-transparency-act",
    "title": "Lawmaker Names 6 Men Hidden in Epstein Files Despite Transparency Act",
    "summary": "The documents were sitting in government vaults for years, millions of pages of emails, flight logs, and calendars detailing Jeffrey Epstein's connections to some of the world's most powerful figures.",
    "topic": "Khanna and Massie name six redacted individuals from Epstein files on House floor",
    "people": ["khanna", "david-rubenstein", "donald-trump", "ghislaine-maxwell", "jeffrey-epstein", "leslie-wexner", "pam-bondi", "prince-andrew", "ro-khanna", "thomas-massie"],
    "tags": ["transparency-act", "court-documents", "document-release", "political", "breaking"]
  },
  {
    "slug": "2026-02-14-consultants-pitched-epstein-access-to-ny-democrats-for-donations",
    "title": "Consultants Pitched Epstein Access to NY Democrats for Donations",
    "summary": "In the shadow of Jeffrey Epstein's death, a new cast of characters has emerged from the document releases that followed the Epstein Transparency Act—not as alleged co-conspirators or enablers, but as political operatives, university administrators, and power brokers.",
    "topic": "Democratic consulting firm solicited Epstein donations for NY politicians",
    "people": ["jeffrey-epstein", "donald-trump", "leslie-wexner", "pam-bondi", "ro-khanna", "thomas-massie"],
    "tags": ["court-documents", "investigation", "associates", "political"]
  }
]
